---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
VertexStreamPositionNormal Properties
VertexStreamPositionNormal Class See Also Send Feedback
---

The VertexStreamPositionNormal type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from VertexStream.) |

# See Also

VertexStreamPositionNormal Class

Autodesk.Revit.DB.DirectContext3D Namespace